{"config": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "cropping": [[40, 20], [0, 0]], "trainable": true, "name": "cropping2d_8"}, "class_name": "Cropping2D"}, {"config": {"output_shape": null, "arguments": {}, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-26-b380085a6314>\u00da\b<lambda>\u000b\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "lambda_5", "function_type": "lambda", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"subsample": [1, 1], "trainable": true, "border_mode": "valid", "nb_filter": 5, "activation": "linear", "name": "convolution2d_17", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_30"}, "class_name": "Activation"}, {"config": {"name": "dropout_14", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "trainable": true, "border_mode": "valid", "nb_filter": 5, "activation": "linear", "name": "convolution2d_18", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_31"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_7", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "trainable": true, "border_mode": "valid", "nb_filter": 3, "activation": "linear", "name": "convolution2d_19", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_32"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_8", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "trainable": true, "border_mode": "valid", "nb_filter": 3, "activation": "linear", "name": "convolution2d_20", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_33"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_9", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_5"}, "class_name": "Flatten"}, {"config": {"name": "dropout_15", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": 1140, "output_dim": 1024, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dtype": "float32", "W_constraint": null, "name": "dense_18", "init": "glorot_uniform", "batch_input_shape": [null, 1140], "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_34"}, "class_name": "Activation"}, {"config": {"name": "dropout_16", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": 1024, "output_dim": 512, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dtype": "float32", "W_constraint": null, "name": "dense_19", "init": "glorot_uniform", "batch_input_shape": [null, 1024], "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_35"}, "class_name": "Activation"}, {"config": {"name": "dropout_17", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": 512, "output_dim": 128, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dtype": "float32", "W_constraint": null, "name": "dense_20", "init": "glorot_uniform", "batch_input_shape": [null, 512], "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_36"}, "class_name": "Activation"}, {"config": {"input_dim": 128, "output_dim": 32, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dtype": "float32", "W_constraint": null, "name": "dense_21", "init": "glorot_uniform", "batch_input_shape": [null, 128], "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_37"}, "class_name": "Activation"}, {"config": {"input_dim": 32, "output_dim": 1, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dtype": "float32", "W_constraint": null, "name": "dense_22", "init": "glorot_uniform", "batch_input_shape": [null, 32], "bias": true, "b_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}